![imagen](./img/hr.png)

In [ ]:
# https://www.sqltutorial.org/
# Ejemply pymsql + aws + pandas
import pymysql
import pandas as pd
ENDPOINT="hrdb.cn2cwau8envf.eu-north-1.rds.amazonaws.com"
PORT=3306
USER="admin"
REGION="eu-north-1b"
DBNAME="hrdb"
conn =  pymysql.connect(host=ENDPOINT, user=USER, passwd="BootcampDSPT24$", port=PORT)

In [67]:

sql = "SELECT * from regions;"
pd.read_sql(sql, conn)

C:\Users\jonat\AppData\Local\Temp\ipykernel_460\1062131233.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(sql, conn)

   region_id             region_name
0          1                  Europe
1          2                Americas
2          3                    Asia
3          4  Middle East and Africa

Selecciona todas las columnas y filas de la tabla employees

Seleccion únicamente las columnas    
employee_id, 
first_name, 
last_name, 
hire_date
de employees

Selecciona las columnas:
first_name, 
last_name, 
salary
e incrementa un 5% el salario de todos los empleados

Selecciona las columnas:
first_name, 
last_name, 
salary
e incrementa un 5% el salario de todos los empleados.
Llama a dicha columna new_salary

SELECT
	employee_id,
	first_name,
	last_name,
	hire_date,
	salary
FROM
	employees;
Ejecuta de nuevo esta query por orden alfabético del nombre de empleado